#!/usr/bin/env python
# -*- mode: python; coding: utf-8; -*-

state_list = ['думать', "решить", "сидеть", "стоять",
                   "лежать", "устать", "мечтать", "краснеть",
                   "спать", "находиться", "согласиться", "убедиться",
                   "понять", "стать", "начаться", "узнать",
                   "видеть", "дрожать", "остаться", "забыть",
                   "хотеть", "чувствовать", "казаться", "висеть",
                   "жить", "существовать", "предполагать",
                   "терпеть", "слышать", "любить", "ненавидеть",
                   "зависеть", "загорать", "линять", "заметить",
                   "происходить", "уметь", "состоять", "надеяться"]

do_list = ["ударить", "говорить",  "бежать", "сказать",
                "пить", "петь", "стонать", "ломать",
                "уворачиваться", "прыгать", "облокотиться",
                "упасть", "использовать", "поцеловать", "стереть",
                "кинуть", "шить", "тянуть", "идти", "платить",
                "воспитать", "организовать", "указать", "обнять"
                "осветить", "плыть", "вернуть", "украсть", "убить",
                "открыть", "совершить", "подтянуть", "выдохнуть",
                "стричь", "резать", "свить", "идти", "лететь",
                "строить", "бороться", "улыбаться"]



model_path = r'Word2Vec_models\ruscorpora_upos_skipgram_300_5_2018.vec'
objects_path = r"D:\Kursovaya\objects\\"


person_list = ["человек", "девушка", "сын", "рабочий", "сотрудник", "гитарист", "персонаж", "бог", "президент", "убийца",
               "миллионер", "художник", 'ярославич', 'барнаулец', 'подругой', 'алена', 'медсестр', 'дедулька', "пекарь",
               "маляр", "социопат", "миллениал", "врач", "ребенок", "директор", "урод", "собеседник", "враг", "друг",
               "водитель", "прохожий", "владелец", "собственник", "певец", "грабитель", "пьяница", "вождь", "мастер",
               "она", "телохранитель", "пользователь", "мазохистка", "босс", "тиран"]

non_person_list = ["стол", "гитара", "корова", "таракан", "видео", "миллион", "еда", "нос", "нога", "свеча",
                   'палеозой', 'недосмотр', 'морозь', 'недосмотр', 'занос', 'отдышка', 'нюх', 'выпас', 'парковка', 'влажность',
                   'кашель', 'заведывание', 'увлажнение', 'кашель', 'подработки', 'выгул',
                   'проседь', 'передержка', 'замерзание', 'умывание', 'паранджа', 'тугоухость', 'вспашка', 'отдышка', 'амбарчик',
                    'ледника', 'заикание', 'обоняние', 'пробела', 'сурки', 'зимовка', 'ужина', 'циркуляция', 'запой',
                   'осадка', 'травление', 'конъюнктивит', 'прочесывание', 'нюх', 'стычка', 'авитаминоз', "испытание", "рама",
                   "собачка", "прохождение", "существование", "магазин", "плюшка", "сторона", "заклинание", "причина",
                   "жизнь", "искусство", "совместительство", "живой", "имя", "улыбка", "нехер", "тобой"]

emotional_list = ["Страсть", "рабство", "война", "сила", "слабость", "одиночество"]
non_emotional_list = ["стол", "видео", "мочь", "делать", "быть", "нос", "иметь"]
