cruel_word_list = ["сволочь", "расчлененка", "труп", "убийца", "насильник", "дура", "дурак", "кишки", "сука"]
non_cruel_word_list = ["человек", "стол", "кошка", "собака", "ракета", "ужин", "улыбка", "животные", "мороз", "холод",
                       "жара", "тело", "карандаш", "подворотня", "ледянка", "банан", "фрукты", "сук"]

person_list = ["человек", "девушка", "сын", "рабочий", "сотрудник", "гитарист", "персонаж", "бог", "президент", "убийца",
               "миллионер", "художник", 'ярославич', 'барнаулец', 'подругой', 'алена', 'медсестр', 'дедулька', "пекарь",
               "маляр", "социопат", "миллениал", "врач", "ребенок", "директор", "урод", "собеседник", "враг", "друг",
               "водитель", "прохожий", "владелец", "собственник", "певец", "грабитель", "пьяница", "вождь", "мастер",
               "она", "телохранитель", "пользователь", "мазохистка", "босс", "тиран"]

non_person_list = ["стол", "гитара", "корова", "таракан", "видео", "миллион", "еда", "нос", "нога", "свеча",
                   'палеозой', 'недосмотр', 'морозь', 'недосмотр', 'занос', 'отдышка', 'нюх', 'выпас', 'парковка',
                   'влажность', 'кашель', 'заведывание', 'увлажнение', 'кашель', 'подработки', 'выгул',
                   'проседь', 'передержка', 'замерзание', 'умывание', 'паранджа', 'тугоухость', 'вспашка', 'отдышка',
                   'амбарчик', 'ледника', 'заикание', 'обоняние', 'пробела', 'сурки', 'зимовка', 'ужина', 'циркуляция',
                   'запой', 'осадка', 'травление', 'конъюнктивит', 'прочесывание', 'нюх', 'стычка', 'авитаминоз',
                   "испытание", "рама", "собачка", "прохождение", "существование", "магазин", "плюшка", "сторона",
                   "заклинание", "причина", "жизнь", "искусство", "совместительство", "живой", "имя", "улыбка", "нехер",
                   "тобой"]