cruel_word_list = ["сволочь", "расчлененка", "труп", "убийца", "насильник", "дура", "дурак", "кишки", "сука", 'кровь',
                   'выстрел', 'бугай', 'битой', 'ножом', 'лезвие', 'мент', 'убить', 'расчлененка', 'отрезал',
                   'изнасилование', 'насилие', 'маньяк', 'зверски', 'паника', 'наркомания', 'похищение', 'истязание',
                   'хребет', 'умерли', 'погиб', 'взрывчатка', 'скончался']

non_cruel_word_list = ["человек", "стол", "кошка", "собака", "ракета", "ужин", "улыбка", "животные", "мороз", "холод",
                       "жара", "тело", "карандаш", "подворотня", "ледянка", "банан", "фрукты", "сук", 'школа', 'фильм',
                       'двое', 'застряло', 'обломках', 'результате', 'шею', 'грязи', 'руки', 'налились', 'дочь']

sexual_word_list = ['оргазм', 'интим', 'соблазн', 'страсть', 'голая', 'лифчик', 'люблю', 'поцелуи', 'соитие', 'страсть',
                    'искусительницы', 'стринги', 'объятий', 'возбуждение', 'разврат', 'порно']

non_sexual_word_list = ["человек", "девушка", "сын", "рабочий", "сотрудник", "гитарист", "персонаж", "бог", "президент",
                        "убийца", "миллионер", "художник", 'битой', 'ножом', 'лезвие', 'мент', "стол", "гитара",
                        "корова", "таракан", "видео", "миллион", "еда", "нос", "нога",]

person_list = ["человек", "девушка", "сын", "рабочий", "сотрудник", "гитарист", "персонаж", "бог", "президент", "убийца",
               "миллионер", "художник", 'ярославич', 'барнаулец', 'подругой', 'алена', 'медсестр', 'дедулька', "пекарь",
               "маляр", "социопат", "миллениал", "врач", "ребенок", "директор", "урод", "собеседник", "враг", "друг",
               "водитель", "прохожий", "владелец", "собственник", "певец", "грабитель", "пьяница", "вождь", "мастер",
               "она", "телохранитель", "пользователь", "мазохистка", "босс", "тиран"]

non_person_list = ["стол", "гитара", "корова", "таракан", "видео", "миллион", "еда", "нос", "нога", "свеча",
                   'палеозой', 'недосмотр', 'морозь', 'недосмотр', 'занос', 'отдышка', 'нюх', 'выпас', 'парковка',
                   'влажность', 'кашель', 'заведывание', 'увлажнение', 'кашель', 'подработки', 'выгул',
                   'проседь', 'передержка', 'замерзание', 'умывание', 'паранджа', 'тугоухость', 'вспашка', 'отдышка',
                   'амбарчик', 'ледника', 'заикание', 'обоняние', 'пробела', 'сурки', 'зимовка', 'ужина', 'циркуляция',
                   'запой', 'осадка', 'травление', 'конъюнктивит', 'прочесывание', 'нюх', 'стычка', 'авитаминоз',
                   "испытание", "рама", "собачка", "прохождение", "существование", "магазин", "плюшка", "сторона",
                   "заклинание", "причина", "жизнь", "искусство", "совместительство", "живой", "имя", "улыбка", "нехер",
                   "тобой"]

abstract_words = ['слава', 'благо', 'доброта', 'храбрость', 'смех', 'стойкость', 'уют', 'мировоззрение', 'горечь',
                  'вызов', 'свежесть', 'трусость', 'ничтожество', 'хвастовство', 'реализм', 'гуманизм', 'седина',
                  'спокойствие', 'беда', 'ум', 'нрав', 'горе']

neutral_words = ['зaбoтитьcя', 'зaдepжкa', 'кyдpявый', 'лгaть', 'мyж', 'мeшaть', 'oбeщaть', 'дом', 'книга', 'ветер',
                 'снег', 'читать', 'лежать', 'хорошо', 'видно', 'северный', 'деревянный', 'синий', 'лишний', 'час',
                 'дружба', 'поле']

motivational_words = ['ходьба', 'литье', 'красота', 'технический', 'мучительница', 'приходить', 'приходящий',
                      'наплевательский', 'опорожнить', 'довольствоваться', 'наполняет', 'ноша', 'создаете', 'возможно']